# По порядку, по частоте использования (на мой взгляд):

# append(item): добавляет элемент item в конец списка
# count(item): возвращает количество вхождений элемента item в список
# sort([key]): сортирует элементы
# reverse(): расставляет все элементы в списке в обратном порядке
# remove(item): удаляет элемент item
# insert(index, item): добавляет элемент item в список по индексу index
# pop([index]): удаляет и возвращает элемент по индексу index
# clear(): удаление всех элементов из списка

# По моему небольшому опыту, чаще всего приходится добавлять данные, считать их количество
# Сортировка тоже часто встречается, остальные методы очень полезны, но реже используются.